var map = L.map('map').setView([31.771959,35.217018], 8);




var posterData = getData();
L.tileLayer('http://{s}.tile.osm.org/{z}/{x}/{y}.png', {
    attribution: '&copy; <a href="http://osm.org/copyright">OpenStreetMap</a> contributors'
}).addTo(map);
posterData = posterData.sort(function(a,b){
  return a.date >= b.date?1:-1
  //return a.date >= b.date?1:-1
})
function searchResults(str,sortAsc){
    
    for(var i=0;i<posterData.length;i++){
      if( ! str ){
        resultItem(posterData[i])
      }
      else if(posterData[i]['text'].indexOf(str) > -1){
        resultItem(posterData[i],str)
      }else{
        if(posterData[i].marker){removeMarker(posterData[i])}
        var el = document.getElementById("id_"+posterData[i].id)
        if(el){
          el.parentElement.removeChild(el)
        }
      }
      
    }
}

function resultItem(item,str){
  if(document.getElementById("id_"+item.id)){
    document.getElementById("id_match_"+item.id).innerText = getWordsAround(str,item.text);
    if(!str){document.getElementById("id_match_"+item.id).innerText = ''}
    return;
  }
  var container = document.getElementById('search_results');
  var res = document.createElement('li');
  res.className = 'res_li'
  res.id = "id_"+item.id;
  res.style.borderBottom = "1px solid";

  
  var title = document.createElement('h3');
  title.innerText = item.title?item.title:'ארכיון';

  var pubPlace = document.createElement('h4');
  pubPlace.innerText = "מקום ההוצאה: " + item.pubPlace;


  var date = document.createElement('h4');
  date.innerText = "תאריך: " + item.date;
  
  var match = document.createElement('b');
  match.id = "id_match_"+item.id
  if(str){match.innerText = getWordsAround(str,item.text);}
  if(!str){match.innerText = '';}
  
  res.appendChild(title);
  res.appendChild(pubPlace);
  res.appendChild(date);
  res.appendChild(match);
  res.marker = addMarker(item);
  res.onclick = function(e){
    this.marker.openPopup();
  }
  container.appendChild(res)
}

function getWordsAround(str,text){
  var arr = text.split(' ');
  var i;
  output = '';
  for( i = 0;i<arr.length;i++){
    if(arr[i].indexOf(str)>-1){break;}
  }
  if(i > 0) {output += arr[i-1] + ' ';}
  if(arr[i])output += arr[i] + ' ';
  if(arr[i+1]) output += arr[i+1];
  return output;

}
function openModal(e){
  //modal.setContent('<img src = "'+e.src+'"/>');
  //modal.open()
}
function addMarker(item){
  if(item.marker){return};
  var id = item['id'];
 // var leafIcon = new L.Icon({
//    iconUrl:'/images/sifria.png',
//     iconSize:[30, 30],
 // })
  var source = item.source?item.source:'';
  var rnd1 = Math.random() /10
  var rnd2 = Math.random() /10
  item.marker =  L.marker([item.lat+rnd1,item.long+rnd2]/*,{icon:leafIcon}*/).addTo(map);
  item.marker.bindPopup("<img src = 'public/images/"+item.id + ".jpg' onclick = 'openModal(this)' style = 'width:450px'/>" +
    "<p>"+source+"</p>"
    ,{maxWidth : 560});
  return item.marker;

}
function removeMarker(item){
  if(item.marker){item.marker.remove()}
  item.marker = null;
}
function initSearch(){
  document.getElementById('search_bar').onkeyup = function(e){
    searchResults(e.target.value);
  }
}
/*function updateSidebar(data){
  document.getElementById('poster_name').innerText = data.title?data.title:'Title'
  document.getElementById('poster_text').innerText = data.text?data.text:'Text'
  document.getElementById('poster_img').src = '/images/'+data.id + ".jpg"

}*/

initSearch();
searchResults();
function filterMarkers(text,markers){

}

function getData(){

  return [{"id":700173139,"distributor":"ועדת המצב שעי ועד הקהלה העברית בחיפה","title":"צו חרום מס 2","date":"1948-05-27","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"לשם השלמת עבודת הבצורים ובתוקף הכרזת מצב חרום עי מועצת המדינה ובהתאם להוראות הפקוד העליון, מצווים כל הגברים בגיל 16 עד 46 בחיפה רבתי להתגייס לעבודה למשך 2 ימים.העבודה תתחיל ביום א כא אייר תשח 30.5 ותסתיים ביום ו ד סיון תשח 11.6 כל גבר בגיל 16 עד 46 יקבל צו התיצבות אישי, בו יצוינו 2 הימים שנקבעו לעבודתו.הפטורים מחובת הגיוס לפי צו זה, יפנו לאחר שיקבלו את צו ההתיצבות האישי, ללשכות השחרור מטעם ועדת המצב.מחובת גיוס זה פטורים העובדים בשרותים הבאים (רק באותם הימים שהם עסוקים בתפקידם) 1. בתי חולים ומרפאות 2. שרותים סניטריים של העיריה וועד הדר הכרמל 3. אספקת מים (רק מכונאים ומשגיחים על הרשת) 4. ייצור חשמל, השגחה והחזקת הקוים 5. נמל 6. רכבת 7. דאר וטלפון 8. מפעלי הנפט 9. אפית לחם וחלוקתו 10. חלוקת חלב ודלק 11. תחבורה עירונית ובין עירונית (במספר מצומצם) 12. ייצור קרח וחלוקתו 13. בעלי כרטיסי התיצבות מדרגת בריאות ג וד (לבנים וצהובים) 14. ממלאי תפקיד בשרותי הבטחוןעל מקום לשכות השחרור תבוא הודעה מיוחדת.חיילים בעלי תעודות מעבר ופנקסי חיילים וכן בעלי כרטיסי התיצבות מדרגת בריאות ג וד (לבנים וצהובים) אינם זקוקים לתעודת שחרור.מקומות הרכוז למתיצבים: בשעה 7 בבקר הדר הכרמל א. חצר הטכניון ב. עי בית הספר גאולה הר הכרמל בנין מוריה עיר התחתית מרכז מסחרי החדש (עי בית כרמל מזרחי) נוה שאנן עי בית הועד תל-עמל עי בית הועד בת-גלים עי רחוב העליה קרית חיים א. שכון חדש - עי בית התרבות ב. קרית חיים המזרחית (הישנה) עי בית הקפה קרית מוצקין שדרות השופטים, עי בית הכנסת קרית שמואל וגב-ים - עי בית העולים קרית ביאליק עי בית הועד קרית בנימין, קרית שטנד ועיר גנים בכביש הכניסה לעיר-גנים כפר אתא עי תחנת האוטובוסיםכוחות הבטחון יפקחו על מלוי צו זה."},{"id":700173119,"distributor":"מפקד ההגנה במחוז חיפה","title":"השלטון העברי עם תום הקרבות","date":"1948-05-03","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"עם תום הקרבות בתבוסת האויב - הודעתי ביום יג ניסן תשח 22.4.48, כי ההגנה תהווה את השלטון העברי העצמאי בעיר.עצוב המצב בחיפה מאז הודעתי הנל מאפשר כבר לכוחות ההגנה לחזור למלוי תפקידיהם הצבאיים בלבד.אי-לזאת, מהיום כד ניסן תשח 3.5.48 ואילך יטפלו המוסדות הנבחרים של הישוב העברי בחיפה בכל הבעיות של האוכלוסיה האזרחית וסיפוק צרכיה."},{"id":700173131,"distributor":"ועד העדה הספרדית","title":"לשוב לדירות הקבועות","date":"1948-04-26","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"בהתאם להוראות מפקד ההגנה וועדת המצב שליד ועד הקהלה בחיפה אנו פונים לכל הפליטים לשוב לדירותיהם הקבועות בהקדם."},{"id":700173189,"distributor":"הארגונים הכלכליים בחיפה והסביבה","title":"אספת מחאה נגד הצעת חוק הארנונה לפצוי נזקי המלחמה","date":"1950-05","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"ביום ראשון, כ אייר תשי (7.5.50) בשעה 7.30 בערב באולם המכבי, רח בלפור פנת הרצל תתקיים אספת מחאה של חברי כל הארגונים הכלכליים בחיפה והסביבה נגד הצעת חוק הארנונה לפצוי נזקי המלחמהבואו בהמונים להפגין את התנגדותכם הנמרצת נגד מס בלתי צודק זה המאיים על כל ענפי הכלכלה הבמעמסה כבדה נוספת שבכוחה להכריעם לבלי קום!"},{"id":700173115,"distributor":"ועד הקהלה","title":"שבתון כללי כמחאה נגד קצוץ העליה","date":"1934-05-22","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"בהתאם להחלטת אספת הנבחרים מכריז ועד הקהלה על שבתון כללי ביום רביעי ט סיון (23.5.34) משעה 1 בצהרים עד 7 בערב בתור מחאה נגד קצוץ העליהכל בעלי בתי מסחר, חרשת, אכל, מכוניות, משרדים, פקידים, פועלים, עובדים וכו מתבקשים ונדרשים להפסיק את העבודה והתנועה בשעה האמורה, בדיוק נמרץבאותו היום תתקימנה אספות מחאה פומביות במקומות דלהלן: בשעה 4 באמפיתיאטרון בשעה 4 בשכונת בת גלים (בבית הכנסת) בשעה 4 בנוה שאנן (בבית-עם) בשעה 4 באחוזת הרברט סמואל (בבית הכנסת) בשעה 4 בשכונת קרית חיים (בבית-עם)"},{"id":700174447,"distributor":"מזכיר העיר תל-אביב","title":"השאלת תלבשות העדלידע","date":"1933-05-17","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"כפי שהודענו למר קמיני שלנו אשר בטח מסר את הדבר לבא-כחכם, הרי מסכימים אנו להשאיל לכם חלק מן התלבשות שהוכנו על ידינו לחגיגת העדלידע, לשמוש עבור חגיגות הבכורים אשר תערכנה בעירכם.קבלנו לתשומת לב את הודעתכם על דבר אחריותכם הגמורה להחזרת הבגדים האלה מיד לאחר החגיגה בשלמותם ובסדר."},{"id":700173538,"distributor":"ועד העדה הספרדית","title":"הזהרה שלא לפרוש מכנסת-ישראל","date":"1938-05-16","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"בשעה כה חמורה והרת-סכנות לישוב העברי בארץ-ישראל, שעה המחייבת כל יהודי הנאמן לעמו לשמר יותר מאשר בכל זמן אחר על אחדות הישוב, ובשעה שועדת תיווך מטפלת בחיסול ההתבדלות מכנסת-ישראל לטובת אחדות הקהלה העברית בכלל, ואחדות הספרדים ובני עדות המזרח בינם לבין עצמם בפרט, מצטערים אנו מאד לשמע שישנם עוד אנשים המחתימים על יציאה מכנסת-ישראל בהבטיחם עבודה למחוסריה.אנו מוצאים על כן לחובתנו הלאומית להזהיר את בני עדתנו לבל ילכו שולל אחרי הבטחות מסופקות, היות ויציאה מכנסת-ישראל פרושה פרישה מהצבור ומכלל ישראל וגורמת נזק רב, הן במובן המוסרי והן במובן החמרי, לעדה הספרדית בכלל ולמתבדלים בפרט.הנאמנות לאחדות הישוב אינה נקנית ונמכרת אלא עומדת היא מעל לכל חשבונות חמריים ואישיים.הננו מזהירים את בני עדתנו לבלי לחתם על הצהרות יציאה מכנסת ישראל. כל אלה שחתמו בודאי בשגגה, מחובתם לתקן את המעוות ולפנות תכף ומיד לועד הקהלה לשם בטול חתימתם ובזה ישמרו על כבודם ושמם הטוב."},{"id":700173021,"distributor":"ועדת המצב שעי ועד הקהלה, המחלקה לכלכלה","title":"מנת בשר כשר לפסח","date":"1948-04-26","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"אנו מודיעים לקהל כי אלה שלא קבלו את מנת הבשר הכשר שלהם לפסח לפי תלוש מס 20 עליהם לפנות היום ומחר לאטליזים: א. איידלין רח סירקין 34 א. ביאליסטוק רח סירקין, בית קרמן כדי לקבל את מנתם."},{"id":700172945,"distributor":"ועד הקהלה, ועדת המצב","title":"להנזר מאכילת בשר בקר וכבש","date":"1947-12-19","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"האימפורטרים הערבים של הבקר משתמשים במצב שנוצר ורוצים עי העלאת מחירי הבקר החי להבנות על חשבון הצרכן העברי.כדי לבלום את ההתפתחות הזאת, שהיא הרת סכנות פוליטיות וכלכליות לישוב העברי, החליטה ועדת המצב של ועד הקהלה להטיל על הצבור, כי ינזר מאכילת בשר בקר וכבש עד להוראה חדשה.זהו צו השעה, כדי להראות שאין הישוב מופקר לתעלולי המסחר הערבי."},{"id":700172953,"distributor":"מפקד עיר חיפה","title":"חזרה לדירות הקבועות","date":"1948-04-26","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"בקשר לשנוי שחל במצב הבטחון בחיפה - אין עוד כל הצדקה כי תושבי הספר והשכונות המעורבות ימשיכו לשבת מחוץ למקומות מגוריהם הקודמים - על כן אני מצוה:על כל הפליטים לשוב מיד לדירותיהם הקבועות בהן הת-גוררו עד ליום 29.11.47.הזקוקים לעזרה בהעברה למקומותיהם יפנו ללשכת הפליטים של ועדת המצב."},{"id":700173017,"distributor":"ועדת המצב, לשכת הפליטים","title":"שכון קבע לפליטי הספר","date":"1948-04-15","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"זכות ההרשמה: 1. לפליטים מוכרים עי לשכת הפליטים. 2. לפליטים ששוכנו זמנית בבתי-ספר שונים, בתי-כנסת, מקומות צבוריים, מחנות, חדרי כביסה וכו. 3. ההרשמה היא אישית.ההרשמה תחל ביום שלישי, 20 באפריל ותמשך עד 6 במאי 1948, בשעות 10-12 לפהצ, 4-6 אחהצ ברחוב ארלוזורוב 3א, קומה א."},{"id":700173053,"distributor":"ועד ההורים של גולי קניה בחיפה","title":"שביתת רעב","date":"1948-03-22","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"שהוכרזה ל-24 שעות כמאמץ להחשת החזרתם ארצה לפני סיום המנדט מתחילה היום, יום שני, יא באדר ב תשח (22.3.48) בשעה 9 בבקר בועד הקהלה בחיפהעל השובתים והמצטרפים לשביתה להביא אתם: ספר תהלים ותנך, כר קטן ושמיכהכל עצורי עתלית החליטו על הצטרפותם לשביתת הרעב."},{"id":700174160,"distributor":"ועד הר הכרמל, ארגון בעלי בתי מלון בהר הכרמל","title":"מס מרגוע","date":"1946-06-27","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"אנו מודיעים בזה לקהל הקייטנים כי מס מרגוע בשעור של 20 מיל ליום ולא פחות מ-100 מיל לכל חשבון יגבה החל מיום 1.7.46 על ידי בעלי בתי מלון ופנסיונים בהר הכרמל."},{"id":700172778,"distributor":"ליגה V למען ברית המועצות","title":"מסיבה - יובל ה-25 לצבא האדום","date":"1943-03","source":"ארכיון העיר חיפה","pubPlace":"חיפה","lat":32.81841,"long":34.9885,"text":"במוצש 13.3.43 בשעה 8 באולם ביתנו מסיבה ליובל ה-25 לצבא האדוםבתכנית: נאומים: מניה שוחט, י. זרובבל הקראות: מרים ברנשטין-כהן שירי הצבא האדום: מקהלת הקבוץ עין המפרץ בניצוחו של משה ביקכרטיסים במחיר 49 מאי להשיג: בועדת התרבות (ביתנו) במשרד הליגה, רח ארלוזורוב 15 ובמטבח הפועלים."},{"id":700252294,"distributor":"עזמי נששיבי, מנהל לשכת המודיען","title":"תמונות הסברה בקשר עם המלחמה","date":"1940-11-17","source":"ארכיון העיר נתניה","pubPlace":"נתניה","lat":32.33291,"long":34.85992,"text":"הנני שולח לכם בזה מספר תמונות הסברה בקשר עם המלחמה הנוכחית.אני תקוה שתמצאו מקומות מתאימים (לוחות מודעות וכו) להדבקת הצלומים האלה וכמו כן אבקשכם להודיעני, אם ברצונכם להמשיך בקבלת חומר זה."},{"id":700252838,"distributor":"י. גוברניק, קצין המחוז","title":"מרפאה לבהמות של אנשים עניים","date":"1938-07-27","source":"ארכיון העיר נתניה","pubPlace":"נתניה","lat":32.33291,"long":34.85992,"text":"נא להביא לתשומת לב אנשי המקום שהחל מהראשון לאוגוסט 1938, תפתח במשרדי הוטרינר בנתניה מרפאה לבהמות לשם רפוי מחלות קלות ונתינת רפואות חנם עבור בהמות של אנשים עניים.2. המרפאה תהיה פתוחה לקהל בימים א וד בכל שבוע."},{"id":700252027,"distributor":"מזכירות המועצה","title":"שני חמורים נמצאו","date":"1939-01-30","source":"ארכיון העיר נתניה","pubPlace":"נתניה","lat":32.33291,"long":34.85992,"text":"שני חמורים נמצאו.בעל האבדה יכול לקבל פרטים על מקום המצאם אצל ה פנחס סגל."},{"id":700252642,"distributor":"צ. פייקוביץ","title":"יצירת ארגון ארצי מכל מגדלי הקלמנטינה","date":"1938-01-30","source":"ארכיון העיר נתניה","pubPlace":"נתניה","lat":32.33291,"long":34.85992,"text":"מפנים בזה את תשומת לב מגדלי הקלמנטינה במקום על יצירת ארגון ארצי מכל בעלי המטעים מסוג זה עי התאחדות האכרים.כל בעלי המטעים"},{"id":700106920,"distributor":"המועצה המקומית פת","title":"בקור הנציב העליון","date":"1929-01-09","source":"ארכיון העיר פתח תקווה","pubPlace":"פתח תקווה","lat":32.08707,"long":34.88747,"text":"היום, כז טבת פט ב-3 אחהצ יבקרו את מושבתנו ה. מ. הנציב העליון סיר זון צנסלור ורעיתו, בלוית פקידי הממשלה הגבוהים.תכנית הבקור: יכנס למושבה בדרך הכביש הממשלתי ויעבר את המושבה עד רחוב פינסקר ויסתובב לרחוב חובבי-ציון, ויכנס לבית הכנסת, מבית הכנסת יצא לרחוב מוהליבר, הרצל, רוטשילד וישוב דרך רחוב חובבצ, לאולם המועצה המקומית. מהמועצה המקומית ישוב בחזרה לרחוב חובבצ אל דרך הכביש הממשלתי.הקהל מתבקש להשתתף בפועל בפגישה לקשט את הבתים בדגלים לאומיים, וככ להשגיח על הסדר לבל לרוץ ולהדחק ממקום למקום."},{"id":700107177,"distributor":"המועצה המקומית","title":"אזהרה לבעלי התבואה, החציר והשקדים","date":"1927-06-03","source":"ארכיון העיר פתח תקווה","pubPlace":"פתח תקווה","lat":32.08707,"long":34.88747,"text":"כל בעלי התבואה, החציר והשקדים מוזהרים בזה לא לדוש את הגרנות ולא לקצץ במקצצה את ערמות החשש ולא לקטוף את השקדים טרם שתהיה מודעה שניה מאת המועצה המקומית, שתרשה את כל הנל.העובר על זה יענש בכל חומר הדין ויסבול מזה בעצמו."},{"id":700107715,"distributor":"ז. ר. טשנסלור נציב עליון ומפקד עליון","title":"מנשר","date":"1929-09-01","source":"ארכיון העיר פתח תקווה","pubPlace":"פתח תקווה","lat":32.08707,"long":34.88747,"text":"בשובי מאנגליה מצאתי לצערי הרב את הארץ במצב של בלבולים וטרף למעשי אלמות בלתי חוקיים.שמעתי בזועה את מעשי האכזריות שנעשו עי כנופיות של פושעים אכזריים ושואפי דם, על מעשי פראות שנעשו באנשים מהישוב היהודי מחוסרי הגנה, מבלי התחשב עם גילם או עם מינם, שהיו מלווים, כמו שקרה בחברון, בהתעללויות אכזריות שאין הפה יכול לבטאם, על שרפות בתים ומשקים בעיר ובכפר, ועל ביזת רכוש וחורבנו.פשעים אלה יביאו על ראשי עושיהם את מארתם וזעמם של כל אנשי התרבות בכל רחבי תבל.חובותי הראשונות הנן להשיב את הסדר בארץ ולהטיל עונש חמור על כל אלה שימצאו אשמים במעשי אלמות. יאחזו בכל האמצעים הנחוצים להגשים את המטרות האלה והריני דורש מכל תושבי הארץ לסייע לי במילוי חובותי.בהתאם להתחייבות שנתתי לועד הפועל הערבי לפני שעזבתי את הארץ בחדש יוני, פתחתי, בהיותי בלונדון, במומ ובשיחות עם מזכיר הממלכה בענין שנויים קונסטיטוציונליים בפלשתינה (אי). לרגלי המאורעות האחרונים אני אפסיק את המומ הזה עם ממשלת הוד מלכותו.בכדי לשים קץ לשמועות הכוזבות שהחלו נפוצות בזמן האחרון בענין הכותל המערבי, הריני מודיע בזה ברבים בהסכמת ממשלת הוד מלכותו שיש בדעתי לתת תוקף לעיקרים שנקבעו בספר הלבן מיום 19 בנובמבר 1928, לאחר שתקבענה שטות הטלת העיקרים הללו."},{"id":700107724,"distributor":"יור המועצה המקומית","title":"מאפיה למצה מקומית","date":"1930-03-19","source":"ארכיון העיר פתח תקווה","pubPlace":"פתח תקווה","lat":32.08707,"long":34.88747,"text":"מתכבדים אנו להודיע לקהל שאחרי קושיים גדולים עלה בידינו לפתוח מאפיה למצה מקומית.המחיר נקבע ל-140 מאי כל רוטילעל המזמינים להרשם בחנות הה דיסקין אפרתי בשוק לא יאוחר מיום א ניסן תרץ 30.3.30.ואנו מעירים את תשומת לב התושבים: שאלה שרוצים במצה מקומית ימהרו להרשם לא יאוחר מהזמן הקבוע לעיל - כי הקבלנים צריכים לדעת מראש את הכמות הנחוצה להכין.אלו שלא ירשמו עד הזמן הנל אין הקבלנים אחראים להספיק להם מצה מקומית."},{"id":700107363,"distributor":"ועדת החנוך והתרבות שעי המועצה המקומית בפתח-תקוה","title":"הזמנה להרצאה בנושא ארכיאולוגיה","date":"1933-11-21","source":"ארכיון העיר פתח תקווה","pubPlace":"פתח תקווה","lat":32.08707,"long":34.88747,"text":"ביום החמשי ה לחודש כסלו תרצד 23.11.33 בשעה 8 בערב ירצה הדר ב. מייזלר באולם המועצה המקומית בפתח-תקוה על הנושא:- החפירות באחרונות בארץ ישראל ובסוריה בלוית פנס קסם.הזמנו את הארכיאולוג המפורסם דר מייזלר להרצות על נושא זה כי יש תגליות חשובות בחפירות שמפיצות אור מדברי ימי עמנו בארץ מלפני הגלות."},{"id":700107669,"distributor":"הסתדרות החקלאים פתח-תקוה ועדת הקלוב","title":"משחק סימולטני בשח-מט","date":"1934-04","source":"ארכיון העיר פתח תקווה","pubPlace":"פתח תקווה","lat":32.08707,"long":34.88747,"text":"ביום הרביעי י אייר 25.4.34 בשעה 7:30 בערב בדיוק יערך בקלוב החקלאים פתח-תקוה משחק סימולטני בשח-מט עי ה מ. מרמורשלהרשם בכל יום במשרד הועד החקלאי"},{"id":700107192,"distributor":"המועצה המקומית פת","title":"סם להשמדת מזיקים","date":"1932-10-26","source":"ארכיון העיר פתח תקווה","pubPlace":"פתח תקווה","lat":32.08707,"long":34.88747,"text":"מתכבדים אנו להודיע לקהל הנכבד שאפשר להשיג סם להשמדת עכברי בית ושדה, וככ כלבים, חתולים ושועלים.אצל הרופא הויטרנרי במושבתנו הדר פרבר יוסף בדירתו הפרטית שברחוב הרצל, סמטת שפירא."},{"id":700107678,"distributor":"ועדת הפקוח על רכוש ערבי","title":"מונתה ועדת פקוח על רכוש ערבי","date":"1948-04","source":"ארכיון העיר פתח תקווה","pubPlace":"פתח תקווה","lat":32.08707,"long":34.88747,"text":"על פי המוסדות ובהתאם להחלטה שנתקבלה במועצה - מונתה ועדת פקוח על רכוש ערבי או על רכוש שלערבי יש בו זכויות בשטח איזור המועצה המקומית (האיזור הכפרי) פתח-תקוה.על כל אדם שהחכיר את אדמתו לערבי או שעשה הסכם עם ערבי לעבד במשותף שטח קרקע או שהעביר את זכויותיו על קרקע לחלוטין או לתקופה מסוימת, להודיע על כך לועדה לפקוח על רכוש ערבי במשרדי המועצה הכפרית, רחוב נורדוי פתח-תקוה, עד לא יאוחר מיום שלישי, 20.4.1948 שעה 10 לפנהצ."}]
}
